arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
    DEBUG_TRACE("M8QReceiver::fetch_navigation_database: requesting navigation database");

    // Request a dump of the navigation database
    m_rx_buffer.pending = false;
    poll_contents(UBX::MessageClass::MSG_CLASS_MGA, UBX::MGA::ID_DBD);

    auto last_update = rtc->gettime();
    
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MGA)
            {
                if (header_ptr->msgId == UBX::MGA::ID_DBD)
                {
                    //DEBUG_TRACE("GPS MGA-DBD <-");

                    // Check we have enough space in our buffer to receive this
                    if (m_rx_buffer.len + 1 > sizeof(m_navigation_database) - m_navigation_database_len)
                    {
                        m_navigation_database_len = 0; // Invalidate the data we did receive
                        DEBUG_ERROR("M8QReceiver::fetch_navigation_database: received database is larger than storage buffer");
                        return SendReturnCode::DATA_OVERSIZE;
                    }

                    *write_dst++ = m_rx_buffer.len; // Preface each message with its length for easier resending
                    m_navigation_database_len++;
                    memcpy(write_dst, &m_rx_buffer.data[0], m_rx_buffer.len);
                    write_dst += m_rx_buffer.len;
                    m_navigation_database_len += m_rx_buffer.len;
                    number_of_mga_dbd_msgs++;
                    last_update = rtc->gettime();
                }
                else if (header_ptr->msgId == UBX::MGA::ID_ACK)
                {
                    UBX::MGA::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::MGA::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                    //DEBUG_TRACE("GPS MGA-ACK <-");

                    if (msg_ack_ptr->msgPayloadStart == number_of_mga_dbd_msgs)
                    {
                        DEBUG_TRACE("M8QReceiver::fetch_navigation_database: received database of size %lu", m_navigation_database_len);
                        return SendReturnCode::SUCCESS;
                    }
                    else
                    {
                        DEBUG_ERROR("M8QReceiver::fetch_navigation_database: received less MGA-DBD packets then was expected, %lu vs %lu", number_of_mga_dbd_msgs, msg_ack_ptr->msgPayloadStart);
                        m_navigation_database_len = 0; // Invalidate the data we did receive
                        return SendReturnCode::MISSING_DATA;
                    }
                }
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - last_update >= timeout)
        {
            DEBUG_ERROR("M8QReceiver::fetch_navigation_database: timed out waiting for response");
            m_navigation_database_len = 0; // Invalidate the data we did receive
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::send_navigation_database()
{
    if (!m_navigation_database_len)
    {
        DEBUG_TRACE("M8QReceiver::send_navigation_database: no database to send");
        return SendReturnCode::SUCCESS;
    }

    DEBUG_TRACE("M8QReceiver::send_navigation_database: sending database of size %lu", m_navigation_database_len);
    m_capture_messages = true;
    uint8_t *send_ptr = &m_navigation_database[0];
    int32_t bytes_to_process = m_navigation_database_len;

    while (bytes_to_process > 0)
    {
        // Fetch the first byte which is the length of the message we are going to send
        uint32_t send_len = *send_ptr++;
        bytes_to_process--;

        // Send the pre-recorded message
        m_rx_buffer.pending = false;
        m_nrf_uart_m8->send(send_ptr, send_len);

        //DEBUG_TRACE("GPS MGA-DBD ->");

        send_ptr += send_len;
        bytes_to_process -= send_len;

        // Wait for the ack, this will only be sent if ackAiding is set in NAVX5
        auto start_time = rtc->gettime();
        const std::time_t timeout = 3;
        for (;;)
        {
            if (m_rx_buffer.pending)
            {
                UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
                if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MGA && header_ptr->msgId == UBX::MGA::ID_ACK)
                {
                    //UBX::MGA::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::MGA::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                    //DEBUG_TRACE("GPS MGA-ACK <- infoCode: %u", msg_ack_ptr->infoCode);
                    break;
                }

                m_rx_buffer.pending = false;
            }

            if (rtc->gettime() - start_time >= timeout)
            {
                DEBUG_ERROR("M8QReceiver::send_navigation_database: timed out waiting for response");
                m_navigation_database_len = 0; // Invalidate the data we did receive
                return SendReturnCode::RESPONSE_TIMEOUT;
            }
        }
    }

    return SendReturnCode::SUCCESS;
}

void M8QReceiver::power_on(std::function<void(GNSSData data)> data_notification_callback = nullptr)
{
    if (m_state == State::POWERED_ON)
        return;
    
    m_state = State::POWERED_ON;

    DEBUG_INFO("M8QReceiver::power_on");

    m_data_notification_callback = data_notification_callback;
    m_capture_messages = true;
    
    if (!m_nrf_uart_m8)
        m_nrf_uart_m8 = new NrfUARTM8(UART_GPS, [this](uint8_t *data, size_t len) { reception_callback(data, len); });

    // Clear our dop and pvt message containers
    memset(&m_last_received_pvt, 0, sizeof(m_last_received_pvt));
    memset(&m_last_received_dop, 0, sizeof(m_last_received_dop));

    // Enable the power supply for the GPS
    GPIOPins::set(BSP::GPIO::GPIO_GPS_PWR_EN);

    nrf_delay_ms(1000); // Necessary to allow the device to boot
    
    SendReturnCode ret;

    ret = setup_uart_port();                  if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_gnss_channel_sharing();       if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = disable_odometer();                 if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = disable_timepulse_output();         if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_power_management();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_lower_power_mode();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_simple_navigation_settings(); if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = setup_expert_navigation_settings(); if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = supply_time_assistance();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = send_navigation_database();         if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = enable_nav_pvt_message();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}
    ret = enable_nav_dop_message();           if (ret != SendReturnCode::SUCCESS) {goto POWER_ON_FAILURE;}

