arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
    //DEBUG_TRACE("GPS CFG-TP5 ->");

    auto ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_TP5, cfg_msg_cfg_tp5);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

    // Disable timepulse 2

    cfg_msg_cfg_tp5.tpIdx = 1;

    //DEBUG_TRACE("GPS CFG-TP5 ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_TP5, cfg_msg_cfg_tp5);
}

M8QReceiver::SendReturnCode M8QReceiver::enable_nav_pvt_message()
{
    CFG::MSG::MSG_MSG cfg_msg_nav_pvt =
    {
        .msgClass = MessageClass::MSG_CLASS_NAV,
        .msgID = NAV::ID_PVT,
        .rate = 1
    };

    //DEBUG_TRACE("GPS CFG-MSG ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_nav_pvt);
}

M8QReceiver::SendReturnCode M8QReceiver::enable_nav_dop_message()
{
    CFG::MSG::MSG_MSG cfg_msg_nav_dop =
    {
        .msgClass = MessageClass::MSG_CLASS_NAV,
        .msgID = NAV::ID_DOP,
        .rate = 1
    };

    //DEBUG_TRACE("GPS CFG-MSG ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_nav_dop);
}

M8QReceiver::SendReturnCode M8QReceiver::disable_nav_pvt_message()
{
    CFG::MSG::MSG_MSG cfg_msg_nav_pvt =
    {
        .msgClass = MessageClass::MSG_CLASS_NAV,
        .msgID = NAV::ID_PVT,
        .rate = 0
    };

    //DEBUG_TRACE("GPS CFG-MSG ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_nav_pvt);
}

M8QReceiver::SendReturnCode M8QReceiver::disable_nav_dop_message()
{
    CFG::MSG::MSG_MSG cfg_msg_nav_dop =
    {
        .msgClass = MessageClass::MSG_CLASS_NAV,
        .msgID = NAV::ID_DOP,
        .rate = 0
    };

    //DEBUG_TRACE("GPS CFG-MSG ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_MSG, cfg_msg_nav_dop);
}
